Tekla Open API Reference for Tekla Structures 2025
ArrowheadAttributes Constructor
Overload List
Name | Description
ArrowheadAttributes()
 Creates a new default arrowhead attributes instance. The default values are ArrowheadPositions.None, ArrowheadTypes.FilledArrow, height 2.0 and width 1.0.
ArrowheadAttributes(ArrowheadPositions, ArrowheadTypes, Double, Double)
 Creates a new arrowhead attributes instance with the given parameters.
Top
See Also
Reference
ArrowheadAttributes Class
Tekla.Structures.Drawing Namespace